## OpenTofu Plan: governance

```

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # azurerm_management_group.connectivity-prod will be created
  + resource "azurerm_management_group" "connectivity-prod" {
      + display_name               = (known after apply)
      + id                         = (known after apply)
      + name                       = "mg-coruscant-connectivity-prod"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (sensitive value)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.decommissioned will be created
  + resource "azurerm_management_group" "decommissioned" {
      + display_name               = (known after apply)
      + id                         = (known after apply)
      + name                       = "mg-coruscant-decommissioned"
      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-root"
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.identity will be created
  + resource "azurerm_management_group" "identity" {
      + display_name               = (known after apply)
      + id                         = (known after apply)
      + name                       = "mg-coruscant-identity"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (sensitive value)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.landingzone will be created
  + resource "azurerm_management_group" "landingzone" {
      + display_name               = (known after apply)
      + id                         = (known after apply)
      + name                       = "mg-coruscant-landingzone"
      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-root"
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.management will be created
  + resource "azurerm_management_group" "management" {
      + display_name               = (known after apply)
      + id                         = (known after apply)
      + name                       = "mg-coruscant-management"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (sensitive value)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.platform will be created
  + resource "azurerm_management_group" "platform" {
      + display_name               = (known after apply)
      + id                         = (known after apply)
      + name                       = "mg-coruscant-platform"
      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-root"
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.sandbox will be created
  + resource "azurerm_management_group" "sandbox" {
      + display_name               = (known after apply)
      + id                         = (known after apply)
      + name                       = "mg-coruscant-sandbox"
      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-root"
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.security-prod will be created
  + resource "azurerm_management_group" "security-prod" {
      + display_name               = (known after apply)
      + id                         = (known after apply)
      + name                       = "mg-coruscant-security-prod"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (sensitive value)
      + tenant_scoped_id           = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```
